performance/mysql8-jemalloc-profiling/logs/1536_1/jemalloc360.run.oltp_point_select.1536.2021-02-12_160721.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1536
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,1536,155825.56,155835.46,155835.46,0.00,0.00,8.74,0.00,0.00
2,1536,1114776.74,1114722.44,1114722.44,0.00,0.00,5.77,0.00,0.00
3,1536,306927.60,306927.60,306927.60,0.00,0.00,5.88,0.00,0.00
4,1536,307016.50,307014.50,307014.50,0.00,0.00,5.88,0.00,0.00
5,1536,307287.25,307289.25,307289.25,0.00,0.00,5.99,0.00,0.00
6,1536,307129.34,307126.34,307126.34,0.00,0.00,5.99,0.00,0.00
7,1536,307130.33,307132.33,307132.33,0.00,0.00,5.99,0.00,0.00
8,1536,307242.75,307242.75,307242.75,0.00,0.00,5.88,0.00,0.00
9,1536,307089.27,307090.27,307090.27,0.00,0.00,5.88,0.00,0.00
10,1536,307249.64,307249.64,307249.64,0.00,0.00,5.88,0.00,0.00
11,1536,308569.97,308566.97,308566.97,0.00,0.00,5.88,0.00,0.00
12,1536,326997.48,326997.48,326997.48,0.00,0.00,5.77,0.00,0.00
13,1536,307308.13,307310.13,307310.13,0.00,0.00,5.88,0.00,0.00
14,1536,307336.73,307336.73,307336.73,0.00,0.00,5.88,0.00,0.00
15,1536,307250.32,307251.32,307251.32,0.00,0.00,5.88,0.00,0.00
16,1536,307307.71,307302.71,307302.71,0.00,0.00,5.88,0.00,0.00
17,1536,307303.39,307306.39,307306.39,0.00,0.00,5.88,0.00,0.00
18,1536,307320.28,307322.28,307322.28,0.00,0.00,5.88,0.00,0.00
19,1536,307242.35,307240.35,307240.35,0.00,0.00,5.99,0.00,0.00
20,1536,307347.00,307349.00,307349.00,0.00,0.00,5.88,0.00,0.00
21,1536,307362.24,307360.24,307360.24,0.00,0.00,5.88,0.00,0.00
22,1536,307329.80,307328.80,307328.80,0.00,0.00,5.88,0.00,0.00
23,1536,307385.05,307384.05,307384.05,0.00,0.00,5.88,0.00,0.00
24,1536,307409.17,307412.17,307412.17,0.00,0.00,5.99,0.00,0.00
25,1536,307363.42,307362.42,307362.42,0.00,0.00,5.88,0.00,0.00
26,1536,307316.20,307318.20,307318.20,0.00,0.00,5.88,0.00,0.00
27,1536,308993.28,308990.28,308990.28,0.00,0.00,5.88,0.00,0.00
28,1536,308678.19,308679.19,308679.19,0.00,0.00,5.88,0.00,0.00
29,1536,307432.82,307431.82,307431.82,0.00,0.00,5.88,0.00,0.00
30,1536,307382.33,307381.33,307381.33,0.00,0.00,5.88,0.00,0.00
31,1536,307292.99,307293.99,307293.99,0.00,0.00,5.88,0.00,0.00
32,1536,307349.40,307348.40,307348.40,0.00,0.00,5.88,0.00,0.00
33,1536,307282.52,307286.52,307286.52,0.00,0.00,5.88,0.00,0.00
34,1536,307370.91,307366.91,307366.91,0.00,0.00,5.88,0.00,0.00
35,1536,307358.91,307362.91,307362.91,0.00,0.00,5.88,0.00,0.00
36,1536,307402.24,307402.24,307402.24,0.00,0.00,5.88,0.00,0.00
37,1536,307456.05,307451.05,307451.05,0.00,0.00,5.99,0.00,0.00
38,1536,307418.23,307422.23,307422.23,0.00,0.00,5.99,0.00,0.00
39,1536,307391.16,307390.16,307390.16,0.00,0.00,5.99,0.00,0.00
40,1536,309251.40,309253.40,309253.40,0.00,0.00,5.99,0.00,0.00
41,1536,308566.74,308563.74,308563.74,0.00,0.00,5.88,0.00,0.00
42,1536,307381.93,307384.93,307384.93,0.00,0.00,5.88,0.00,0.00
43,1536,307379.44,307379.44,307379.44,0.00,0.00,5.99,0.00,0.00
44,1536,307422.47,307422.47,307422.47,0.00,0.00,5.99,0.00,0.00
45,1536,307359.60,307355.60,307355.60,0.00,0.00,5.99,0.00,0.00
46,1536,307360.20,307360.20,307360.20,0.00,0.00,5.88,0.00,0.00
47,1536,307524.07,307524.07,307524.07,0.00,0.00,5.99,0.00,0.00
48,1536,307367.84,307371.84,307371.84,0.00,0.00,5.88,0.00,0.00
49,1536,307350.15,307345.15,307345.15,0.00,0.00,5.99,0.00,0.00
50,1536,307401.03,307404.03,307404.03,0.00,0.00,5.88,0.00,0.00
51,1536,307344.50,307344.50,307344.50,0.00,0.00,5.88,0.00,0.00
52,1536,307342.24,307344.24,307344.24,0.00,0.00,5.88,0.00,0.00
53,1536,307334.96,307331.96,307331.96,0.00,0.00,5.88,0.00,0.00
54,1536,307420.12,307421.12,307421.12,0.00,0.00,5.88,0.00,0.00
55,1536,307353.38,307348.38,307348.38,0.00,0.00,5.88,0.00,0.00
56,1536,307406.75,307412.75,307412.75,0.00,0.00,5.88,0.00,0.00
57,1536,307415.57,307415.57,307415.57,0.00,0.00,5.88,0.00,0.00
58,1536,307495.65,307492.65,307492.65,0.00,0.00,5.88,0.00,0.00
59,1536,307323.55,307323.55,307323.55,0.00,0.00,5.88,0.00,0.00
60,1536,307432.41,307435.41,307435.41,0.00,0.00,5.77,0.00,0.00
61,1536,307448.35,307449.35,307449.35,0.00,0.00,5.88,0.00,0.00
62,1536,307472.09,307467.09,307467.09,0.00,0.00,5.88,0.00,0.00
63,1536,307522.32,307527.32,307527.32,0.00,0.00,5.88,0.00,0.00
64,1536,307459.83,307457.83,307457.83,0.00,0.00,5.88,0.00,0.00
65,1536,307406.06,307405.06,307405.06,0.00,0.00,5.88,0.00,0.00
66,1536,307391.69,307392.69,307392.69,0.00,0.00,5.88,0.00,0.00
67,1536,307426.76,307427.76,307427.76,0.00,0.00,5.99,0.00,0.00
68,1536,307423.02,307421.02,307421.02,0.00,0.00,5.88,0.00,0.00
69,1536,307411.34,307413.34,307413.34,0.00,0.00,5.99,0.00,0.00
70,1536,307438.33,307437.33,307437.33,0.00,0.00,5.99,0.00,0.00
71,1536,308743.91,308745.91,308745.91,0.00,0.00,6.09,0.00,0.00
72,1536,315490.40,315486.40,315486.40,0.00,0.00,5.99,0.00,0.00
73,1536,307408.47,307408.47,307408.47,0.00,0.00,5.99,0.00,0.00
74,1536,307479.22,307483.23,307483.23,0.00,0.00,5.99,0.00,0.00
75,1536,307400.92,307397.92,307397.92,0.00,0.00,5.99,0.00,0.00
76,1536,307432.48,307426.48,307426.48,0.00,0.00,5.99,0.00,0.00
77,1536,307452.85,307459.85,307459.85,0.00,0.00,6.09,0.00,0.00
78,1536,307488.57,307488.57,307488.57,0.00,0.00,5.99,0.00,0.00
79,1536,307426.20,307428.20,307428.20,0.00,0.00,5.99,0.00,0.00
80,1536,307412.02,307408.02,307408.02,0.00,0.00,5.99,0.00,0.00
81,1536,307373.60,307376.60,307376.60,0.00,0.00,5.88,0.00,0.00
82,1536,307460.84,307461.84,307461.84,0.00,0.00,5.99,0.00,0.00
83,1536,307359.06,307357.06,307357.06,0.00,0.00,5.99,0.00,0.00
84,1536,307384.12,307384.12,307384.12,0.00,0.00,5.99,0.00,0.00
85,1536,307331.49,307333.49,307333.49,0.00,0.00,5.99,0.00,0.00
86,1536,307323.98,307323.98,307323.98,0.00,0.00,5.99,0.00,0.00
87,1536,307374.97,307373.97,307373.97,0.00,0.00,5.88,0.00,0.00
88,1536,307401.24,307399.24,307399.24,0.00,0.00,5.88,0.00,0.00
89,1536,307340.18,307337.18,307337.18,0.00,0.00,5.88,0.00,0.00
90,1536,307337.71,307343.71,307343.71,0.00,0.00,5.88,0.00,0.00
91,1536,307416.24,307416.24,307416.24,0.00,0.00,5.88,0.00,0.00
92,1536,307545.52,307541.52,307541.52,0.00,0.00,5.88,0.00,0.00
93,1536,307463.37,307467.37,307467.37,0.00,0.00,5.88,0.00,0.00
94,1536,307446.12,307446.12,307446.12,0.00,0.00,5.88,0.00,0.00
95,1536,310314.35,310312.35,310312.35,0.00,0.00,5.88,0.00,0.00
96,1536,307479.88,307481.88,307481.88,0.00,0.00,5.88,0.00,0.00
97,1536,307465.06,307463.06,307463.06,0.00,0.00,5.88,0.00,0.00
98,1536,307483.97,307479.97,307479.97,0.00,0.00,5.88,0.00,0.00
99,1536,307439.02,307445.02,307445.02,0.00,0.00,5.99,0.00,0.00
100,1536,307447.03,307446.03,307446.03,0.00,0.00,5.88,0.00,0.00
101,1536,307360.71,307361.71,307361.71,0.00,0.00,5.88,0.00,0.00
102,1536,307449.46,307449.46,307449.46,0.00,0.00,5.88,0.00,0.00
103,1536,307429.96,307426.96,307426.96,0.00,0.00,5.88,0.00,0.00
104,1536,307457.37,307459.37,307459.37,0.00,0.00,5.99,0.00,0.00
105,1536,307415.75,307415.75,307415.75,0.00,0.00,5.99,0.00,0.00
106,1536,307464.46,307462.46,307462.46,0.00,0.00,5.99,0.00,0.00
107,1536,307417.08,307419.08,307419.08,0.00,0.00,5.88,0.00,0.00
108,1536,307418.70,307419.70,307419.70,0.00,0.00,5.88,0.00,0.00
109,1536,307428.97,307426.97,307426.97,0.00,0.00,5.99,0.00,0.00
110,1536,307506.69,307508.69,307508.69,0.00,0.00,5.99,0.00,0.00
111,1536,307437.25,307437.25,307437.25,0.00,0.00,5.99,0.00,0.00
112,1536,307497.57,307497.57,307497.57,0.00,0.00,5.99,0.00,0.00
113,1536,307441.39,307437.39,307437.39,0.00,0.00,5.99,0.00,0.00
114,1536,307443.56,307445.56,307445.56,0.00,0.00,5.88,0.00,0.00
115,1536,307424.22,307425.22,307425.22,0.00,0.00,5.88,0.00,0.00
116,1536,307440.14,307437.14,307437.14,0.00,0.00,5.88,0.00,0.00
117,1536,307475.23,307478.23,307478.23,0.00,0.00,5.99,0.00,0.00
118,1536,307473.43,307474.43,307474.43,0.00,0.00,5.99,0.00,0.00
119,1536,307414.72,307411.72,307411.72,0.00,0.00,5.99,0.00,0.00
120,1536,325778.32,325778.32,325778.32,0.00,0.00,5.88,0.00,0.00
121,1536,307655.28,307657.28,307657.28,0.00,0.00,5.88,0.00,0.00
122,1536,307502.09,307503.09,307503.09,0.00,0.00,5.88,0.00,0.00
123,1536,308343.82,308341.81,308341.81,0.00,0.00,5.88,0.00,0.00
124,1536,312517.02,312515.02,312515.02,0.00,0.00,5.88,0.00,0.00
125,1536,307532.38,307534.38,307534.38,0.00,0.00,5.88,0.00,0.00
126,1536,308460.85,308461.85,308461.85,0.00,0.00,5.99,0.00,0.00
127,1536,309891.00,309890.00,309890.00,0.00,0.00,5.99,0.00,0.00
128,1536,307519.60,307518.60,307518.60,0.00,0.00,5.99,0.00,0.00
129,1536,307443.47,307443.47,307443.47,0.00,0.00,5.88,0.00,0.00
130,1536,307511.75,307512.75,307512.75,0.00,0.00,5.88,0.00,0.00
131,1536,307451.72,307451.72,307451.72,0.00,0.00,5.88,0.00,0.00
132,1536,307497.29,307497.29,307497.29,0.00,0.00,5.88,0.00,0.00
133,1536,307471.70,307472.70,307472.70,0.00,0.00,5.77,0.00,0.00
134,1536,307423.09,307424.09,307424.09,0.00,0.00,5.77,0.00,0.00
135,1536,307429.02,307429.02,307429.02,0.00,0.00,5.88,0.00,0.00
136,1536,310398.92,310396.92,310396.92,0.00,0.00,5.88,0.00,0.00
137,1536,307413.71,307409.71,307409.71,0.00,0.00,5.88,0.00,0.00
138,1536,307451.50,307457.50,307457.50,0.00,0.00,5.88,0.00,0.00
139,1536,307393.54,307393.54,307393.54,0.00,0.00,5.88,0.00,0.00
140,1536,307439.75,307434.75,307434.75,0.00,0.00,5.88,0.00,0.00
141,1536,307444.03,307446.03,307446.03,0.00,0.00,5.88,0.00,0.00
142,1536,307408.15,307409.15,307409.15,0.00,0.00,5.88,0.00,0.00
143,1536,307402.62,307402.62,307402.62,0.00,0.00,5.88,0.00,0.00
144,1536,307442.91,307442.91,307442.91,0.00,0.00,5.88,0.00,0.00
145,1536,309186.37,309188.37,309188.37,0.00,0.00,5.88,0.00,0.00
146,1536,308653.15,308651.15,308651.15,0.00,0.00,5.88,0.00,0.00
147,1536,307488.92,307490.92,307490.92,0.00,0.00,5.99,0.00,0.00
148,1536,307504.35,307501.35,307501.35,0.00,0.00,5.99,0.00,0.00
149,1536,307483.37,307484.37,307484.37,0.00,0.00,5.99,0.00,0.00
150,1536,307458.32,307455.32,307455.32,0.00,0.00,5.99,0.00,0.00
151,1536,307485.53,307486.53,307486.53,0.00,0.00,5.99,0.00,0.00
152,1536,307553.93,307556.93,307556.93,0.00,0.00,6.09,0.00,0.00
153,1536,307457.99,307456.99,307456.99,0.00,0.00,6.09,0.00,0.00
154,1536,307521.49,307522.49,307522.49,0.00,0.00,5.99,0.00,0.00
155,1536,307406.43,307407.43,307407.43,0.00,0.00,5.99,0.00,0.00
156,1536,307432.65,307428.65,307428.65,0.00,0.00,5.88,0.00,0.00
157,1536,308271.11,308273.11,308273.11,0.00,0.00,5.88,0.00,0.00
158,1536,309688.82,309690.82,309690.82,0.00,0.00,5.88,0.00,0.00
159,1536,307448.71,307448.71,307448.71,0.00,0.00,5.88,0.00,0.00
160,1536,307419.26,307416.26,307416.26,0.00,0.00,5.99,0.00,0.00
161,1536,306995.46,306995.46,306995.46,0.00,0.00,5.88,0.00,0.00
162,1536,307305.78,307308.78,307308.78,0.00,0.00,5.99,0.00,0.00
163,1536,308126.49,308126.49,308126.49,0.00,0.00,5.88,0.00,0.00
164,1536,309531.17,309531.17,309531.17,0.00,0.00,5.88,0.00,0.00
165,1536,307412.54,307410.54,307410.54,0.00,0.00,5.88,0.00,0.00
166,1536,307461.96,307458.96,307458.96,0.00,0.00,5.99,0.00,0.00
167,1536,307453.64,307455.64,307455.64,0.00,0.00,5.99,0.00,0.00
168,1536,307471.80,307469.80,307469.80,0.00,0.00,5.99,0.00,0.00
169,1536,307430.80,307433.80,307433.80,0.00,0.00,5.99,0.00,0.00
170,1536,307498.95,307498.95,307498.95,0.00,0.00,5.99,0.00,0.00
171,1536,307747.94,307747.94,307747.94,0.00,0.00,5.99,0.00,0.00
172,1536,319205.37,319203.37,319203.37,0.00,0.00,5.77,0.00,0.00
173,1536,307455.59,307455.59,307455.59,0.00,0.00,5.88,0.00,0.00
174,1536,307449.34,307451.34,307451.34,0.00,0.00,5.88,0.00,0.00
175,1536,307439.60,307440.60,307440.60,0.00,0.00,5.88,0.00,0.00
176,1536,307510.98,307511.98,307511.98,0.00,0.00,5.88,0.00,0.00
177,1536,307504.53,307504.53,307504.53,0.00,0.00,5.88,0.00,0.00
178,1536,307602.02,307600.02,307600.02,0.00,0.00,5.88,0.00,0.00
179,1536,307513.90,307511.90,307511.90,0.00,0.00,5.88,0.00,0.00
180,1536,307515.55,307517.55,307517.55,0.00,0.00,5.88,0.00,0.00
181,1536,307514.64,307516.64,307516.64,0.00,0.00,5.99,0.00,0.00
182,1536,307548.91,307544.91,307544.91,0.00,0.00,5.99,0.00,0.00
183,1536,307490.12,307489.12,307489.12,0.00,0.00,5.99,0.00,0.00
184,1536,307551.31,307556.31,307556.31,0.00,0.00,5.99,0.00,0.00
185,1536,307494.85,307492.85,307492.85,0.00,0.00,5.99,0.00,0.00
186,1536,307488.58,307487.58,307487.58,0.00,0.00,5.99,0.00,0.00
187,1536,307443.85,307446.85,307446.85,0.00,0.00,5.99,0.00,0.00
188,1536,307438.10,307438.10,307438.10,0.00,0.00,5.99,0.00,0.00
189,1536,307440.03,307438.03,307438.03,0.00,0.00,5.99,0.00,0.00
190,1536,307403.50,307404.50,307404.50,0.00,0.00,5.88,0.00,0.00
191,1536,307354.79,307353.79,307353.79,0.00,0.00,5.88,0.00,0.00
192,1536,307416.15,307418.15,307418.15,0.00,0.00,5.99,0.00,0.00
193,1536,307334.72,307330.72,307330.72,0.00,0.00,5.88,0.00,0.00
194,1536,307414.65,307414.65,307414.65,0.00,0.00,5.88,0.00,0.00
195,1536,310322.25,310325.25,310325.25,0.00,0.00,5.99,0.00,0.00
196,1536,307478.00,307476.00,307476.00,0.00,0.00,5.99,0.00,0.00
197,1536,307478.57,307479.57,307479.57,0.00,0.00,5.99,0.00,0.00
198,1536,307509.22,307509.22,307509.22,0.00,0.00,5.99,0.00,0.00
199,1536,309967.64,309966.64,309966.64,0.00,0.00,5.99,0.00,0.00
200,1536,311025.45,311028.45,311028.45,0.00,0.00,5.88,0.00,0.00
201,1536,307348.91,307348.91,307348.91,0.00,0.00,5.88,0.00,0.00
202,1536,310324.27,310323.27,310323.27,0.00,0.00,5.88,0.00,0.00
203,1536,307396.37,307394.37,307394.37,0.00,0.00,5.99,0.00,0.00
204,1536,307438.07,307441.07,307441.07,0.00,0.00,5.88,0.00,0.00
205,1536,307440.50,307438.50,307438.50,0.00,0.00,5.88,0.00,0.00
206,1536,307406.25,307407.25,307407.25,0.00,0.00,5.88,0.00,0.00
207,1536,307476.27,307469.27,307469.27,0.00,0.00,5.88,0.00,0.00
208,1536,307323.13,307331.13,307331.13,0.00,0.00,5.88,0.00,0.00
209,1536,307388.93,307388.93,307388.93,0.00,0.00,5.88,0.00,0.00
210,1536,307425.77,307422.77,307422.77,0.00,0.00,5.99,0.00,0.00
211,1536,307476.59,307475.59,307475.59,0.00,0.00,5.99,0.00,0.00
212,1536,307515.33,307517.33,307517.33,0.00,0.00,5.88,0.00,0.00
213,1536,307461.83,307463.83,307463.83,0.00,0.00,5.88,0.00,0.00
214,1536,307495.33,307491.33,307491.33,0.00,0.00,5.99,0.00,0.00
215,1536,307717.76,307719.76,307719.76,0.00,0.00,5.99,0.00,0.00
216,1536,307402.52,307403.52,307403.52,0.00,0.00,5.88,0.00,0.00
217,1536,307357.27,307356.27,307356.27,0.00,0.00,5.88,0.00,0.00
218,1536,307409.94,307409.94,307409.94,0.00,0.00,5.77,0.00,0.00
219,1536,307467.53,307467.53,307467.53,0.00,0.00,5.77,0.00,0.00
220,1536,308648.60,308648.60,308648.60,0.00,0.00,5.77,0.00,0.00
221,1536,309393.62,309392.62,309392.62,0.00,0.00,5.77,0.00,0.00
222,1536,307458.28,307460.28,307460.28,0.00,0.00,5.88,0.00,0.00
223,1536,307413.51,307411.51,307411.51,0.00,0.00,5.88,0.00,0.00
224,1536,316744.16,316747.16,316747.16,0.00,0.00,5.77,0.00,0.00
225,1536,307428.64,307428.64,307428.64,0.00,0.00,5.88,0.00,0.00
226,1536,307526.44,307521.44,307521.44,0.00,0.00,5.88,0.00,0.00
227,1536,307522.46,307525.46,307525.46,0.00,0.00,5.99,0.00,0.00
228,1536,307461.53,307460.53,307460.53,0.00,0.00,5.88,0.00,0.00
229,1536,307470.30,307473.30,307473.30,0.00,0.00,5.88,0.00,0.00
230,1536,307488.72,307488.72,307488.72,0.00,0.00,5.88,0.00,0.00
231,1536,307467.89,307466.89,307466.89,0.00,0.00,5.88,0.00,0.00
232,1536,307488.93,307483.93,307483.93,0.00,0.00,5.99,0.00,0.00
233,1536,307461.75,307465.75,307465.75,0.00,0.00,6.09,0.00,0.00
234,1536,307539.75,307537.75,307537.75,0.00,0.00,6.09,0.00,0.00
235,1536,307553.86,307557.86,307557.86,0.00,0.00,5.99,0.00,0.00
236,1536,307522.41,307522.41,307522.41,0.00,0.00,5.99,0.00,0.00
237,1536,307503.62,307498.62,307498.62,0.00,0.00,5.99,0.00,0.00
238,1536,307499.33,307502.33,307502.33,0.00,0.00,5.99,0.00,0.00
239,1536,307419.40,307421.40,307421.40,0.00,0.00,5.99,0.00,0.00
240,1536,307392.77,307388.77,307388.77,0.00,0.00,5.88,0.00,0.00
241,1536,307379.13,307383.13,307383.13,0.00,0.00,5.88,0.00,0.00
242,1536,307471.47,307469.47,307469.47,0.00,0.00,5.88,0.00,0.00
243,1536,307421.96,307422.96,307422.96,0.00,0.00,5.88,0.00,0.00
244,1536,307429.80,307427.80,307427.80,0.00,0.00,5.88,0.00,0.00
245,1536,307393.71,307390.71,307390.71,0.00,0.00,5.88,0.00,0.00
246,1536,307428.63,307432.63,307432.63,0.00,0.00,5.88,0.00,0.00
247,1536,307390.78,307390.78,307390.78,0.00,0.00,5.88,0.00,0.00
248,1536,307365.22,307367.22,307367.22,0.00,0.00,5.88,0.00,0.00
249,1536,307378.05,307376.05,307376.05,0.00,0.00,5.88,0.00,0.00
250,1536,309162.98,309161.98,309161.98,0.00,0.00,5.88,0.00,0.00
251,1536,308657.62,308657.62,308657.62,0.00,0.00,5.88,0.00,0.00
252,1536,307433.38,307436.38,307436.38,0.00,0.00,5.88,0.00,0.00
253,1536,307394.73,307394.73,307394.73,0.00,0.00,5.88,0.00,0.00
254,1536,307391.10,307389.10,307389.10,0.00,0.00,5.88,0.00,0.00
255,1536,307484.69,307484.69,307484.69,0.00,0.00,5.88,0.00,0.00
256,1536,307536.30,307537.30,307537.30,0.00,0.00,5.88,0.00,0.00
257,1536,307396.97,307397.97,307397.97,0.00,0.00,5.88,0.00,0.00
258,1536,307421.90,307419.90,307419.90,0.00,0.00,5.88,0.00,0.00
259,1536,307430.19,307432.19,307432.19,0.00,0.00,5.99,0.00,0.00
260,1536,307484.76,307483.76,307483.76,0.00,0.00,5.99,0.00,0.00
261,1536,307461.72,307460.72,307460.72,0.00,0.00,5.99,0.00,0.00
262,1536,307492.13,307494.13,307494.13,0.00,0.00,5.99,0.00,0.00
263,1536,308110.10,308104.10,308104.10,0.00,0.00,5.88,0.00,0.00
264,1536,310274.47,310277.47,310277.47,0.00,0.00,5.99,0.00,0.00
265,1536,307489.78,307490.78,307490.78,0.00,0.00,5.88,0.00,0.00
266,1536,307503.03,307505.03,307505.03,0.00,0.00,5.99,0.00,0.00
267,1536,307491.56,307489.56,307489.56,0.00,0.00,5.88,0.00,0.00
268,1536,307495.35,307497.35,307497.35,0.00,0.00,5.88,0.00,0.00
269,1536,307421.49,307421.49,307421.49,0.00,0.00,5.88,0.00,0.00
270,1536,307507.36,307505.36,307505.36,0.00,0.00,5.88,0.00,0.00
271,1536,307381.49,307380.49,307380.49,0.00,0.00,5.88,0.00,0.00
272,1536,307491.38,307494.38,307494.38,0.00,0.00,5.99,0.00,0.00
273,1536,307451.89,307447.89,307447.89,0.00,0.00,5.99,0.00,0.00
274,1536,307469.16,307473.16,307473.16,0.00,0.00,5.88,0.00,0.00
275,1536,307377.83,307375.83,307375.83,0.00,0.00,5.88,0.00,0.00
276,1536,307447.18,307445.18,307445.18,0.00,0.00,5.88,0.00,0.00
277,1536,307493.01,307491.01,307491.01,0.00,0.00,5.88,0.00,0.00
278,1536,307463.17,307467.17,307467.17,0.00,0.00,5.88,0.00,0.00
279,1536,307422.29,307421.29,307421.29,0.00,0.00,5.88,0.00,0.00
280,1536,307413.19,307412.19,307412.19,0.00,0.00,5.88,0.00,0.00
281,1536,307341.81,307342.81,307342.81,0.00,0.00,5.88,0.00,0.00
282,1536,307389.57,307390.57,307390.57,0.00,0.00,5.88,0.00,0.00
283,1536,307451.15,307450.15,307450.15,0.00,0.00,5.88,0.00,0.00
284,1536,307412.39,307412.39,307412.39,0.00,0.00,5.88,0.00,0.00
285,1536,307334.75,307336.75,307336.75,0.00,0.00,5.88,0.00,0.00
286,1536,307434.35,307433.35,307433.35,0.00,0.00,5.88,0.00,0.00
287,1536,307464.15,307466.15,307466.15,0.00,0.00,5.88,0.00,0.00
288,1536,307398.78,307397.78,307397.78,0.00,0.00,5.88,0.00,0.00
289,1536,307322.42,307321.42,307321.42,0.00,0.00,5.88,0.00,0.00
290,1536,307400.32,307402.32,307402.32,0.00,0.00,5.88,0.00,0.00
291,1536,307515.32,307515.32,307515.32,0.00,0.00,5.88,0.00,0.00
292,1536,307587.00,307585.00,307585.00,0.00,0.00,5.99,0.00,0.00
293,1536,307586.67,307586.67,307586.67,0.00,0.00,5.88,0.00,0.00
294,1536,307560.31,307559.31,307559.31,0.00,0.00,5.99,0.00,0.00
295,1536,307451.21,307452.21,307452.21,0.00,0.00,5.88,0.00,0.00
296,1536,307466.93,307468.93,307468.93,0.00,0.00,5.88,0.00,0.00
297,1536,307423.85,307420.85,307420.85,0.00,0.00,5.88,0.00,0.00
298,1536,307522.63,307522.63,307522.63,0.00,0.00,5.88,0.00,0.00
299,1536,307465.94,307466.94,307466.94,0.00,0.00,5.88,0.00,0.00
300,1536,307110.47,307112.46,307112.46,0.00,0.00,5.88,0.00,0.00
SQL statistics:
    queries performed:
        read:                            92352630
        write:                           0
        other:                           0
        total:                           92352630
    transactions:                        92352630 (307549.24 per sec.)
    queries:                             92352630 (307549.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.2842s
    total number of events:              92352630

Latency (ms):
         min:                                    0.05
         avg:                                    4.98
         max:                                 1011.55
         95th percentile:                        5.88
         sum:                            460197157.55

Threads fairness:
    events (avg/stddev):           60125.4102/1351.16
    execution time (avg/stddev):   299.6075/0.18